import {setConfirm} from "../../utils/useInfoMessage.js";

export default class Journal {
//==============================================================//
    //---DOM-селекторы--//
    selectors = {
        root: '[data-js-journal]',
        back: '[data-js-journal-back]',
        reload: '[data-js-journal-reload]',
    }
    //==============================================================//


    //==============================================================//
    //---классы--//
    classes = {
        isActive: 'is-active'
    }
    //==============================================================//


    //==============================================================//
    //---переменные--//
    constructor() {

        this.journalElement = $(this.selectors.root);

        this.backBtn = this.journalElement.find(this.selectors.back);
        this.reloadBtn = this.journalElement.find(this.selectors.reload);

        this.loadFunctions();
        this.bindEvents();
    }
    //==============================================================//


    //==============================================================//
    //---функции, выполняющиеся сразу после загрузки страницы--//
    loadFunctions = () => {

    }
    //==============================================================//


    //==============================================================//
    //---обработчики событий--//
    bindEvents() {
        this.backBtn.on('click', () => {
            window.location.href = '../../../../groups.html';
        });

        this.reloadBtn.on('click', async () => {
            let confirmed = await setConfirm('Перезагрузить страницу?');
            if (confirmed) {
                location.reload();
            }
        })
    }
    //==============================================================//


    //==============================================================//
    //---обращения к серверу--//

    //==============================================================//


    //==============================================================//
    //---функции--//

    //==============================================================//
}